Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: Known culprits are fetchmail (with the mimedecode option enabled), formail (from procmail 3.14 only) and evolution.
pt_pt: Alguns softwares que fazem isso são o fetchmail (com a opção mimedecode habilitada), o formail (do procmail versão 3.14) e o evolution.

source: Q: How is security handled in Debian?
pt_pt: Q: Como o Debian lida com a segurança?

source: A: Once the security team receives a notification of an incident, one or more members review it and consider its impact on the stable release of Debian (i.e. if it's vulnerable or not). If our system is vulnerable, we work on a fix for the problem. The package maintainer is contacted as well, if they didn't contact the security team already. Finally, the fix is tested and new packages are prepared, which are then compiled on all stable architectures and uploaded afterwards. After all of that is done, an advisory is published.
pt_pt: R: Assim que o Time de Segurança recebe uma notificação sobre um incidente, um(a) ou mais membros(as) revisam e avaliam seu impacto sobre a versão estável (stable) do Debian (ou seja, se ela é vulnerável ou não). Se nosso sistema é vulnerável, nós trabalhamos em uma correção para o problema. O(A) mantenedor(a) do pacote é contatado(a) também, se ele(a) já não contatou o Time de Segurança antes. Finalmente, a correção é testada e novos pacotes são preparados, compilados em todas as arquiteturas da versão estável e feito o upload. Depois de tudo isso, um alerta é publicado.

source: Q: Why are you fiddling with an old version of that package?
pt_pt: Q: Por que vocês insistem em uma versão antiga de determinado pacote?

source: The most important guideline when making a new package that fixes a security problem is to make as few changes as possible. Our users and developers are relying on the exact behaviour of a release once it is made, so any change we make can possibly break someone's system. This is especially true in case of libraries: make sure you never change the Application Program Interface (API) or Application Binary Interface (ABI), no matter how small the change is.
pt_pt: R: A regra mais importante quando está se fazendo um novo pacote que corrige problemas de segurança é fazer o menor número possível de alterações. Nossos(as) usuários(as) e desenvolvedores(as) confiam no comportamento correto de uma versão uma vez que ela é lançada, então qualquer mudança que fazemos tem o potencial de quebrar o sistema de alguém. Isso é verdade especialmente no caso de bibliotecas: certifique-se de nunca modificar a Interface de Programação de Aplicação (API - Application Programming Interface) ou a Interface Binária de Aplicação (ABI - Application Binary Interface), não importa quão pequena seja essa alteração.

source: This means that moving to a new upstream version is not a good solution, instead the relevant changes should be backported. Generally upstream maintainers are willing to help if needed, if not the Debian security team might be able to help.
pt_pt: Isso significa que mudar para a nova versão do(a) autor(a) do software (upstream) não é uma boa solução, em vez disso as alterações relevantes devem ser adaptadas à versão antiga. Geralmente os(as) autores(as) do software dessas novas versões se dispõem a ajudar se for preciso; caso contrário, o Time de Segurança do Debian está disponível para ajudar.

source: In some cases it is not possible to backport a security fix, for example when large amounts of source code need to be modified or rewritten. If that happens it might be necessary to move to a new upstream version, but this has to be coordinated with the security team beforehand.
pt_pt: Em alguns casos não é possível adaptar a versão antiga a uma correção de segurança, por exemplo quando uma grande quantidade de código-fonte precisa ser modificada ou reescrita. Se isto acontecer pode ser necessário mudar para a nova versão do(a) autor(a) do software, mas isso deve ser coordenado antecipadamente com o Time de Segurança.

source: Q: The version number for a package indicates that I am still running a vulnerable version!
pt_pt: Q: O número de versão de um pacote indica que eu ainda estou executando uma versão vulnerável!

source: A: Instead of upgrading to a new release we backport security fixes to the version that was shipped in the stable release. The reason we do this is to make sure that a release changes as little as possible so things will not change or break unexpectedly as a result of a security fix. You can check if you are running a secure version of a package by looking at the package changelog, or comparing its exact version number with the version indicated in the Debian Security Advisory.
pt_pt: R: Em vez de atualizar para uma versão nova, nós adaptamos correções de segurança das versões mais novas para a versão lançada com a versão estável (stable). A razão para que façamos isto é certificar-nos de que uma versão mude o mínimo possível, de forma que nada quebre ou mude inesperadamente como consequência de uma correção de segurança. Você pode checar se está executando uma versão segura de um pacote verificando o seu registro de mudanças, ou comparando o número exato da versão com a versão indicada no alerta de segurança Debian.

source: Q: I received an advisory, but the build for one processor architecture seems to be missing.
pt_pt: Q: Eu recebi um alerta, mas parece que está faltando a construção do pacote para uma arquitetura de processamento .

source: A: Generally the Security Team releases an advisory with builds of the updated packages for all architectures that Debian supports. However, some architectures are slower than others and it may happen that builds for most architectures are ready while some are still missing. These smaller archs represent a small fraction of our user base. Depending on the urgency of the issue we may decide to release the advisory forthwith. The missing builds will be installed as soon as they come available, but no further notice of this will be given. Of course we will never release an advisory where the i386 or amd64 builds are not present.
pt_pt: R: Geralmente, o Time de Segurança lança alertas com construções dos pacotes atualizados para todas as arquiteturas que o Debian suporta. Entretanto, algumas arquiteturas são mais lentas que outras e isso pode levar a que construções estejam prontas para grande parte das arquiteturas, enquanto outras ainda estejam faltando. Estas pequenas arquiteturas representam uma pequena fração da nossa base de usuários(as). Dependendo da urgência do problema, podemos decidir por lançar um alerta imediatamente. As arquiteturas ausentes serão instaladas tão logo estejam prontas, mas nenhuma notícia será divulgada além disso. Claro que nós nunca faremos uso de alertas quando construções para i386 ou amd64 não estejam presentes.

source: Q: How is security handled for unstable?
pt_pt: Q: Como a segurança é feita na instável (unstable)?

source: A: Security for unstable is primarily handled by package maintainers, not by the Debian Security Team. Although the security team may upload high-urgency security-only fixes when maintainers are noticed to be inactive, support for stable will always have priority. If you want to have a secure (and stable) server you are strongly encouraged to stay with stable.
pt_pt: R: A segurança na instável (unstable) é principalmente gerenciada por mantenedores(as) de pacote, não pelo Time de Segurança do Debian. Embora o Time de Segurança possa fazer o upload de correções muito urgentes e exclusivamente relacionadas à segurança quando sabe que os(as) mantenedores(as) estão inativos(as), o suporte à estável (stable) será sempre a prioridade. Se você deseja um servidor seguro (e estável), nós fortemente encorajamos que fique com a estável (stable).

source: Q: How is security handled for testing?
pt_pt: Q: Como a segurança é feita na teste (testing)?

source: A: Security for testing benefits from the security efforts of the entire project for unstable. However, there is a minimum two-day migration delay, and sometimes security fixes can be held up by transitions. The Security Team helps to move along those transitions holding back important security uploads, but this is not always possible and delays may occur. Especially in the months after a new stable release, when many new versions are uploaded to unstable, security fixes for testing may lag behind. If you want to have a secure (and stable) server you are strongly encouraged to stay with stable.
pt_pt: R: A segurança para a teste (testing) se beneficia dos esforços de segurança de todo o projeto para a instável (unstable). Contudo, há um atraso de migração de no mínimo dois dias, e às vezes as correções de segurança podem ser adiadas pelas transições. O Time de Segurança ajuda a lidar com essas transições que seguram importantes uploads de segurança, mas isto não é sempre possível e atrasos podem ocorrer. Especialmente nos meses que sucedem uma nova versão estável (stable), quando muitas versões novas são enviadas para a instável (unstable) e correções de segurança para a teste (testing) podem atrasar. Se você deseja um servidor seguro (e estável), nós fortemente encorajamos que fique com a estável (stable)

source: Q: How is security handled for contrib, non-free and non-free-firmware?
pt_pt: Q: Como a segurança é feita para a contrib, a non-free e a non-free-firmware?

source: A: The short answer is: it's not. Contrib, non-free and non-free-firmware aren't official parts of the Debian Distribution and are not released, and thus not supported by the security team. Some non-free packages are distributed without source or without a license allowing the distribution of modified versions. In those cases no security fixes can be made at all. If it is possible to fix the problem, and the package maintainer or someone else provides correct updated packages, then the security team will generally process them and release an advisory.
pt_pt: R: A resposta curta é: não é feita. A contrib, a non-freee e a non-free-firmware não fazem parte oficialmente da distribuição Debian e não são lançadas, por isso não são suportadas pelo Time de Segurança. Alguns pacotes non-free são distribuídos sem o código-fonte ou com uma licença que não permite a distribuição de versões modificadas. Nesses casos, nenhuma correção de segurança pode ser feita. Se for possível corrigir o problema, e o(a) mantenedor(a) do pacote ou outra pessoa fornecer pacotes corrigidos, o Time de Segurança geralmente irá processá-los e publicar um alerta.

source: Q: The advisory says unstable is fixed in version 1.2.3-1, but unstable has 1.2.5-1, what's up?
pt_pt: Q: O alerta diz que a instável (unstable) foi corrigida na versão 1.2.3-1, mas a instável (unstable) contém a versão 1.2.5-1, o que aconteceu?

source: A: We try to list the first version in unstable that fixed the problem. Sometimes the maintainer has uploaded even newer versions in the meantime. Compare the version in unstable with the version we indicate. If it's the same or higher, you should be safe from this vulnerability. If you want to be sure, you can check the package changelog with apt-get changelog package-name and search for the entry announcing the fix.
pt_pt: R: Nós tentamos listar a primeira versão na instável (unstable) que corrigiu o problema. Algumas vezes o(a) mantenedor(a) enviou versões mais novas neste meio tempo. Compare a versão na instável (unstable) com a versão que nós indicamos. Se for a mesma ou maior, você estará seguro(a) com relação a esta vulnerabilidade. Se quiser ter certeza, você pode verificar o registro de mudanças do pacote com apt-get changelog package-name e procurar pela entrada que mostra a correção.

source: Q: Why are there no official mirrors for security.debian.org?
pt_pt: Q: Por que não há espelhos oficiais do security.debian.org?

source: A: Actually, there are. There are several official mirrors, implemented through DNS aliases. The purpose of security.debian.org is to make security updates available as quickly and easily as possible.
pt_pt: R: Na verdade, eles existem. Há vários espelhos oficiais, implementados através de aliases DNS. O propósito do security.debian.org é tornar as atualizações de segurança disponíveis da maneira mais rápida e fácil possível.

source: Encouraging the use of unofficial mirrors would add extra complexity that is usually not needed and that can cause frustration if these mirrors are not kept up to date.
pt_pt: Encorajar o uso de espelhos não oficiais causaria tanto uma complexidade extra desnecessária, quanto frustração ao encontrar um desses espelhos desatualizados.

source: Q: I've seen DSA 100 and DSA 102, now where is DSA 101?
pt_pt: Q: Vi o DSA 100 e o DSA 102, agora, onde está o DSA 101?

source: A: Several vendors (mostly of GNU/Linux, but also of BSD derivatives) coordinate security advisories for some incidents and agree to a particular timeline so that all vendors are able to release an advisory at the same time. This was decided in order to not discriminate some vendors that need more time (e.g. when the vendor has to pass packages through lengthy QA tests or has to support several architectures or binary distributions). Our own security team also prepares advisories in advance. Every now and then, other security issues have to be dealt with before the parked advisory could be released, and hence temporarily leaving out one or more advisories by number.
pt_pt: R: Vários distribuidores (a maioria deles de GNU/Linux, mas também de variações do BSD) coordenam alertas de segurança para alguns incidentes e concordam com uma determinada linha de tempo para que todos os distribuidores possam lançar um aviso ao mesmo tempo. Isso foi decidido para que não haja discriminação com alguns distribuidores que precisam de mais tempo (por exemplo, quando o distribuidor tem que passar os pacotes por longos testes de controle de qualidade, ou suporta diversas arquiteturas ou distribuições binárias). Nosso próprio Time de Segurança também prepara alertas com antecedência. Dependendo da situação, outros problemas de segurança têm de ser trabalhados antes do aviso que está "parado" ser lançado, e isso causa a lacuna na numeração dos avisos.

source: Q: How can I reach the security team?
pt_pt: Q: Como posso entrar em contato com o Time de Segurança?

source: A: Security information can be sent to security@debian.org or team@security.debian.org, both of which are read by the members of the security team.
pt_pt: R: Informações de segurança podem ser enviadas para security@debian.org ou team@security.debian.org, ambos são lidos pelos(as) membros(as) da equipe de segurança.

source: If desired, email can be encrypted with the Debian Security Contact key (key ID 0x0D59D2B15144766A14D241C66BAF400B05C3E651). For the OpenPGP keys of individual team members, please refer to the keyring.debian.org keyserver.
pt_pt: Caso deseje, o e-mail pode ser criptografado com a chave do Contato de Segurança Debian (o ID da chave é 0x0D59D2B15144766A14D241C66BAF400B05C3E651). Para as chaves OpenPGP de cada um(a) dos(as) membros(as) da equipe, por favor, consulte o servidor de chaves keyring.debian.org.

source: Q: I guess I found a security problem, what should I do?
pt_pt: Q: Acho que encontrei um problema de segurança, o que devo fazer?

source: A: If you learn about a security problem, either in one of your own packages or in someone else's please always contact the security team. If the Debian security team confirms the vulnerability and other vendors are likely to be vulnerable as well, they usually contact other vendors as well. If the vulnerability is not yet public they will try to coordinate security advisories with the other vendors, so all major distributions are in sync.
pt_pt: R: Se você descobrir um problema de segurança, tanto em um dos seus pacotes ou de outra pessoa, por favor, sempre entre em contato com o Time de Segurança. Se o Time de Segurança do Debian confirmar a vulnerabilidade e outros distribuidores também estiverem vulneráveis, eles(as) geralmente contatam estes outros distribuidores. Se a vulnerabilidade ainda não é pública, eles(as) tentam coordenar os alertas de segurança com os alertas dos outros distribuidores para que todas as principais distribuições fiquem sincronizadas.

source: If the vulnerability is already publicly known, be sure to file a bug report in the Debian BTS, and tag it security.
pt_pt: Se a vulnerabilidade já tiver sido divulgada publicamente, certifique-se de preencher um relatório de bug no Debian BTS e marcá-lo como security.

source: If you are a Debian maintainer, see below.
pt_pt: Se você é um(a) mantenedor(a) Debian, veja abaixo.

source: Q: What am I supposed to do with a security problem in one of my packages?
pt_pt: Q: O que eu devo fazer com um problema de segurança em um dos meus pacotes?

source: A: If you learn of a security problem, either in your package or someone else's please always contact the security team via email at team@security.debian.org. They keep track of outstanding security problems, can help maintainers with security problems or fix problems on their own, are responsible for sending out security advisories and maintaining security.debian.org.
pt_pt: R: Se você souber de algum problema de segurança, seja no seu pacote ou no de outra pessoa, por favor, sempre entre em contato com o Time de Segurança através do e-mail team@security.debian.org. Eles(as) mantêm um registro do andamento dos problemas de segurança, podem ajudar mantenedores(as) com problemas de segurança ou até mesmo consertar eles(as) mesmos(as) estes problemas, são responsáveis por mandar os alertas de segurança e mantêm o security.debian.org.

source: The Developer's Reference has complete instructions on what to do.
pt_pt: O documento referência para desenvolvedores(as) tem instruções completas do que fazer.

source: It's particularly important that you don't upload to any other distribution other than unstable without prior agreement by the security team, because bypassing them will cause confusion and more work.
pt_pt: É particularmente importante que você não faça o upload para nenhuma outra versão além da instável (unstable) sem antes entrar em acordo com o Time de Segurança, pois ignorar o Time de Segurança pode causar confusão e mais trabalho.

source: Q: I tried to download a package listed in one of the security advisories, but I got a `file not found' error.
pt_pt: Q: Eu tentei baixar um pacote listado em um dos alertas de segurança, mas recebo um erro 'arquivo não encontrado'.

source: A: Whenever a newer bugfix supersedes an older package on security.debian.org, chances are high that the old package will be removed by the time the new one gets installed. Hence, you'll get this `file not found' error. We don't want to distribute packages with known security bugs longer than absolutely necessary.
pt_pt: R: Quando algum pacote que leva uma correção de bug substitui um pacote antigo em security.debian.org, são grandes as chances de que o pacote antigo seja removido assim que o outro entrar. Portanto, você irá receber o erro 'arquivo não encontrado'. Nós não queremos distribuir pacotes com erros de segurança conhecidos por um período de tempo maior do que o estritamente necessário.

source: Please use the packages from the latest security advisories, which are distributed through the debian-security-announce mailing list. It's best to simply run apt-get update before upgrading the package.
pt_pt: Por favor, use os pacotes dos últimos alertas de segurança, que são distribuídos através da lista de discussão debian-security-announce. É melhor simplesmente executar apt-get update antes de atualizar o pacote.

source: Q: I've got a bugfix, can I upload to security.debian.org directly?
pt_pt: Q: Eu tenho uma correção de bug. Posso enviar diretamente para security.debian.org?

source: A: No, you can't. The archive at security.debian.org is maintained by the security team, who have to approve all packages. You should instead send patches or proper source packages to the security team via team@security.debian.org. They will be reviewed by the security team and eventually uploaded, either with or without modifications.
pt_pt: R: Não, você não pode. O repositório em security.debian.org é mantido pelo Time de Segurança, que deve aprovar todos os pacotes. Em vez disso, você pode enviar correções (patches) ou pacotes-fonte apropriados para o Time de Segurança pelo e-mail team@security.debian.org. Eles serão revisados pelo Time de Segurança e eventualmente enviados ao repositório, com ou sem modificações.

source: Q: I've got a bugfix, can I upload to proposed-updates instead?
pt_pt: Q: Eu tenho uma correção de bug, posso então enviar para o proposed-updates?

source: A: Technically speaking, you can. However, you should not do this, since this interferes badly with the work of the security team. Packages from security.debian.org will be copied into the proposed-updates directory automatically. If a package with the same or a higher version number is already installed into the archive, the security update will be rejected by the archive system. That way, the stable distribution will end up without a security update for this package instead, unless the wrong packages in the proposed-updates directory were rejected. Please contact the security team instead and include all details of the vulnerability and attach the source files (i.e. diff.gz and dsc files) to your mail.
pt_pt: R: Tecnicamente falando, você pode. No entanto, você não deve fazê-lo, uma vez que isso interfere demais no trabalho do Time de Segurança. Os pacotes do security.debian.org serão copiados para o diretório proposed-updates automaticamente. Se um pacote com o mesmo número de versão ou com um número maior já se encontra no repositório, a atualização de segurança será rejeitada pelo sistema de arquivamento. Dessa forma, a versão estável (stable) ficará sem uma atualização de segurança para este pacote, a menos que o pacote errado do repositório proposed-updates seja rejeitado. Por favor, em vez disso, contate o Time de Segurança, inclua todos os detalhes da vulnerabilidade e anexe os arquivos-fonte (por exemplo, diff.gz e arquivos dsc) em seu e-mail.

source: Q: I'm pretty sure my packages are fine, how can I upload them?
pt_pt: Q: Tenho certeza que meus pacotes estão corretos, como posso enviá-los?
